[
    {
        "name": "Amity University Online",
        "about": [
            "Amity University Online provides Anytime, Anywhere educational experience, intensive corporate interaction, industry-oriented teaching delivered by eminent corporate experts and world-class faculty.",
            "Designed to suit both graduate students and working professionals, our programs adhere to UGCs stringent criteria and we are at par with the campus programs. Amity University Online is home to a range of University Grants Commission (UGC) entitled programs meant for anytime, anywhere learning. Amity University Online serves the educational aspirations of students across the globe through its well-researched curriculum, renowned faculty, cutting-edge technology, and close industry-academic partnerships.",
            "Amity University Online is devoted to creating a transformative learning environment. In today's environment, when content is mobile and available anytime, anywhere, learning is truly a click away."
        ],
        "coursesandfees": [
            "MASTER OF BUSINESS ADMINISTRATION",
            "LEARNING EFFORTS: 12/15 HRS A WEEK ",
            "DURATION: 2 YEARS |  CREDITS: 99 ",
            "ACCELERATE YOUR CAREER SUCCESS WITH AMITY'S ONLINE MBA",
            "Amity University Online is a step by Amity, to offer elective online learning for people seeking to improve competency, build expertise, and enhance skills, across diverse disciplines and career paths. Amity's online MBA program is a globally accredited two-year (4 semesters) course with 12 specialization areas and in-built project work designed to prepare graduates for varied career opportunities in business administration. Amity's online degrees are the most preferred online degrees by employers and recruiters globally.",
            "SPECIALISATIONS • Marketing & Sales Management • Entrepreneurship & Leadership Management • Finance & Accounting Management • Human Resource Management • Information Technology Management • International Business Management • Production & Operations Management • Retail Management • Global Finance Market • Hospitality Management • Insurance Management • Petroleum & Natural Gas Management",
            "PROGRAM CURRICULUM",
            "SEMESTER 1",
            "Accounting for Managers • Marketing Management • Managerial Economics • Statistics for Management • Professional communication",
            "SEMESTER 2",
            "Business Research Methods • Financial Management • Human Resource Management • Conflict Resolution & Management • Legal Aspects of Business",
            "SEMESTER 3",
            "Professional Ethics • Strategic Management • Minor Project",
            "SEMESTER 4",
            "Management in Action - Social Economic and Ethical Issues • Digital Marketing • Major Project"
        ],
        "admission": [
            "10th Class Certificate (Completing 10 years of formal schooling)",
            "12th Class Certificate (Completing 12 years of formal schooling)",
            "Graduation completing Degree (3 Years or 4 Years Degree Program)"
        ],
        "placement": "",
        "scholarship": "",
        "gallery": [
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/amity/Amity%20university.jpg",
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/amity/Amity%202.webp",
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/amity/Amity%203.webp",
            "https://github.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/blob/main/assets/college/amity/Amity%204.jpg"
        ],
        "review": [
            "Learning at Amity, has proven to be a blessing in disguise. It helped me groom as a working professional under the guidance of esteemed faculty and the placement team. The programme has been truly beneficial for my career growth. It has enhanced my knowledge and skills that I could easily apply in my work environment.",
            "Firdaus Noorain - Manager"
        ],
        "extra": ""
    },
    {
        "name": "We School - EVERYONE HAS AN EDGE, WE MAKE IT SHARPER.", 
        "about": [
            "YOUR JOURNEY TO MANAGEMENT SHARPNESS BEGINS, WITH WELINGKAR’S HYBRID PROGRAM - AN ADVANCED 2 YEAR P. G. DIPLOMA IN MANAGEMENT (PGDM-HB)",
            "Welingkar Institute of Management is an autonomous Institute and all Hybrid Learning Programs offered by it are autonomous in nature, but it is one of the few institutions whose Distance Learning Programs have been recognized by All India Council for Technical Education(AICTE) Program Duration and Registration Validity: These are two year programs offered in the distance mode. The two year program is divided into 4 semesters. The registration validity of these two year Post Graduate Programs is 4 years. The registration validity is subject to payment of full program fees as per the payment schedule. While the Program duration is of two years only, the additional one year is given to students to submit/clear all pending exams/project reports. Students opting for dual specialization will get one more year in addition to the maximum period of 4 years. The additional year is to enable students to complete any pending exams/project reports of the additional specialization.",
            "Salient Features of the Program: The first two semesters are generic, common to all and cover general topics of management. The last two semesters contain specialization related subjects. The specializations offered are: • Marketing • Finance • Human Resource • Operations • Supply Chain Management • General Management • E-Business • International Business • Retail Management • Banking, Investment and Insurance • Services Excellence • Rural and Agri Business • Media and Advertising • Travel and Tourism • Healthcare Management • Hospitality Management • E - Commerce • I. T. Projects Management"
        ],
        "coursesandfees": [
            "KEY PROGRAMS OFFERED",
            "Post Graduate Diploma in Management (Marketing Management) (PGDM - MM - HB) • Post Graduate Diploma in Management (Finance Management) (PGDM - FM - HB) • Post Graduate Diploma in Management (Human Resource Management) (PGDM - HRM - HB) • Post Graduate Diploma in Management (Retail Management ) (PGDM - RM - HB) • Post Graduate Diploma in Management (Operations Management) (PGDM - OM - HB) • Post Graduate Diploma in Management (Supply Chain Management) (PGDM - SCM - HB) • Post Graduate Diploma in Management (Business Administration) (PGDM - BA - HB) • Post Graduate Diploma in Management (E-Business) (PGDM - EB - HB) • Post Graduate Diploma in Management (International Business) (PGDM - IB - HB) • Post Graduate Diploma in Management (Banking, Investment and Insurance) (PGDM - BII - HB) • Post Graduate Diploma in Management (Services Excellence) (PGDM - SE - HB) • Post Graduate Diploma in Management (Rural and Agri Business) (PGDM - RAB - HB) • Post Graduate Diploma in Management (Media and Advertising) (PGDM - MA - HB) • Post Graduate Diploma in Management (Travel and Tourism) (PGDM - TT - HB) • Post Graduate Diploma in Management (Healthcare Management) (PGDM - HCM - HB) • Post Graduate Diploma in Management (Hospitality Management) (PGDM - HOM - HB) • Post Graduate Diploma in Management (E - Commerce) (PGDM - EC - HB) • Post Graduate Diploma in Management (I. T. Projects Management) (PGDM - ITPM - HB)"
        ],
        "admission": [
            "ACADEMIC PROCESS",
            "On taking admission, students are given 1st year kit of study material, which consist of 9 books. Study material for few subjects is provided only in the form of E - book. Further, students can attend internet based live virtual classroom session for select subjects as well as quarterly Personel Contact Program (PCP) at the institute during the 1st year. PCP are optional and can be attended after paying additional nominal fees. Simultaneously, students are activated on the system so that they can check various facilities offered to them like : E-Learning Tool Kit, WeLectures, WeTube, NewsWire service, Placement opportunity etc.",
            "EVALUATION CRITERIA AND ASSESSMENTS",
            "In every semester, there is a mid-term exam and a semester exam. • Every subject portion is divided into two parts. The mid-term exam is based on a few initial chapters and the semester exam is based on the remaining chapters. • Both mid-term as well as semester exams are out of 50 marks. However, a mid-term assignment carries about 20% weightage and a semester exam carries 80% weightage. To clear a subject, a student has to secure minimum 50% marks which is a total weightage percentage of both exams",
            "Enrollment • There will be four batches each year- January, April, July and October • Specialization should be selected in the enrollment form. Preferred center for the examination / PCP center should also be selected in the enrollment form itself",
            "Enclosures • Evidence of graduation • 1 recent passport size colour photograph"
            
        ],
        "placement": [
            "Placement Support System",
            "For the convenience of students, a new initiative has been undertaken by the PGDM-Hybrid Learning Cell, 'Placement Information'. Job opportunities and global vacancies are uploaded on our website, www.welingkaronline.org on a daily basis. A student, after enrolling for the program, can see all job openings state-wise and specialization-wise on the website, under the head 'Placement Opportunities'."
        ],
        "scholarship": "",
        "gallery":  [
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/we%20school/We%20School.jpeg",
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/we%20school/We%20school%20%202.jpeg",
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/we%20school/We%20school%203.jpeg",
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/we%20school/We%20school%204.webp",
            "https://raw.githubusercontent.com/FITTOCIO-TECHNOLOGIES/distanceLearningData/main/assets/college/we%20school/We%20school%205.jpg"
        ],
        "review": [
            "The PGDM-HB program helped me grow to my potential and reach to the blue ocean in my career. This program builds leadership qualities through experimental learning workshops. It’s really a boon for the working professionals who can take benefits of this excellent courseware, learn through its e-learning modules, and take help from professors in web-based classroom sessions as per their own convenience and flexibility.",
            "Diganta Sengupta",
            "SR Consultant",
            "Capgemini India Pvt Ltd",
            "This course has given me a better understanding of how the entire management process works. The value added activities here, VCF lectures, workshops, etc, help you get in touch with people from different sectors and from different walks of life. You can witness how they deal with life and how the HB program is currently helping them.",
            "Rebecca Figueiredo"
        ],
        "extra": ""
    }
]