[
    {
        "name": "",
        "about":"Amity University Online provides ‘Anytime, Anywhere’ educational experience, intensive corporate interaction, industry-oriented teaching delivered by eminent corporate experts and world-class faculty.
        Designed to suit both graduate students and working professionals, our programs adhere to UGC’s stringent criteria and we are at par with the campus programs. Amity University Online is home to a range of University Grants Commission (UGC) entitled programs meant for anytime, anywhere learning. Amity University Online serves the educational aspirations of students across the globe through its well-researched curriculum, renowned faculty, cutting-edge technology, and close industry-academic partnerships.
        Amity University Online is devoted to creating a transformative learning environment. In today's environment, when content is mobile and available anytime, anywhere, learning is truly a click away.
        ","coursesandfees":"MASTER OF BUSINESS ADMINISTRATION

        LEARNING EFFORTS: 12/15 HRS A WEEK 
        DURATION: 2 YEARS |  CREDITS: 99 
        
        ACCELERATE YOUR CAREER SUCCESS WITH AMITY'S ONLINE MBA 
        Amity University Online is a step by Amity, to offer elective online learning for people seeking to improve competency, build expertise, and enhance skills, across diverse disciplines and career paths. Amity's online MBA program is a globally accredited two-year (4 semesters) course with 12 specialization areas and in-built project work designed to prepare graduates for varied career opportunities in business administration. Amity's online degrees are the most preferred online degrees by employers and recruiters globally.
        
        SPECIALISATIONS • Marketing & Sales Management • Entrepreneurship & Leadership Management • Finance & Accounting Management • Human Resource Management • Information Technology Management • International Business Management • Production & Operations Management • Retail Management • Global Finance Market • Hospitality Management • Insurance Management • Petroleum & Natural Gas Management
        
        PROGRAM CURRICULUM
        SEMESTER 1
        Accounting for Managers • Marketing Management • Managerial Economics • Statistics for Management • Professional communication
        SEMESTER 2
        Business Research Methods • Financial Management • Human Resource Management • Conflict Resolution & Management • Legal Aspects of Business
        SEMESTER 3
        Professional Ethics • Strategic Management • Minor Project
        SEMESTER 4
        Management in Action - Social Economic and Ethical Issues • Digital Marketing • Major Project
        ","admission":"10th Class Certificate (Completing 10 years of formal schooling)12th Class Certificate (Completing 12 years of formal schooling)
        Graduation completing Degree (3 Years or 4 Years Degree Program)
        ","placement": "",
        "scholarship": "",
        "gallery": "",
        "review":"“Learning at Amity, has proven to be a blessing in disguise. It helped me groom as a working professional under the guidance of esteemed faculty and the placement team. The programme has been truly beneficial for my career growth. It has enhanced my knowledge and skills that I could easily apply in my work environment.”
        Firdaus Noorain - Manager 
        ","extra": ""
    },
    {
        "about":"Tagline - EVERYONE HAS AN EDGE, WE MAKE IT SHARPER. 
YOUR JOURNEY TO MANAGEMENT SHARPNESS BEGINS, WITH WELINGKAR’S HYBRID PROGRAM - AN ADVANCED 2 YEAR P. G. DIPLOMA IN MANAGEMENT (PGDM-HB)

Welingkar Institute of Management is an autonomous Institute and all Hybrid Learning Programs offered by it are autonomous in nature, but it is one of the few institutions whose Distance Learning Programs have been recognized by All India Council for Technical Education(AICTE) Program Duration and Registration Validity: These are two year programs offered in the distance mode. The two year program is divided into 4 semesters. The registration validity of these two year Post Graduate Programs is 4 years. The registration validity is subject to payment of full program fees as per the payment schedule. While the Program duration is of two years only, the additional one year is given to students to submit/clear all pending exams/project reports. Students opting for dual specialization will get one more year in addition to the maximum period of 4 years. The additional year is to enable students to complete any pending exams/project reports of the additional specialization.
Salient Features of the Program: The first two semesters are generic, common to all and cover general topics of management. The last two semesters contain specialization related subjects. The specializations offered are: • Marketing • Finance • Human Resource • Operations • Supply Chain Management • General Management • E-Business • International Business • Retail Management • Banking, Investment and Insurance • Services Excellence • Rural and Agri Business • Media and Advertising • Travel and Tourism • Healthcare Management • Hospitality Management • E - Commerce • I. T. Projects Management
","coursesandfees":"KEY PROGRAMS OFFERED  
Post Graduate Diploma in Management (Marketing Management) (PGDM - MM - HB) • Post Graduate Diploma in Management (Finance Management) (PGDM - FM - HB) • Post Graduate Diploma in Management (Human Resource Management) (PGDM - HRM - HB) • Post Graduate Diploma in Management (Retail Management ) (PGDM - RM - HB) • Post Graduate Diploma in Management (Operations Management) (PGDM - OM - HB) • Post Graduate Diploma in Management (Supply Chain Management) (PGDM - SCM - HB) • Post Graduate Diploma in Management (Business Administration) (PGDM - BA - HB) • Post Graduate Diploma in Management (E-Business) (PGDM - EB - HB) • Post Graduate Diploma in Management (International Business) (PGDM - IB - HB) • Post Graduate Diploma in Management (Banking, Investment and Insurance) (PGDM - BII - HB) • Post Graduate Diploma in Management (Services Excellence) (PGDM - SE - HB) • Post Graduate Diploma in Management (Rural and Agri Business) (PGDM - RAB - HB) • Post Graduate Diploma in Management (Media and Advertising) (PGDM - MA - HB) • Post Graduate Diploma in Management (Travel and Tourism) (PGDM - TT - HB) • Post Graduate Diploma in Management (Healthcare Management) (PGDM - HCM - HB) • Post Graduate Diploma in Management (Hospitality Management) (PGDM - HOM - HB) • Post Graduate Diploma in Management (E - Commerce) (PGDM - EC - HB) • Post Graduate Diploma in Management (I. T. Projects Management) (PGDM - ITPM - HB)
","admission":"ACADEMIC PROCESS 
On taking admission, students are given 1st year kit of study material, which consist of 9 books. Study material for few subjects is provided only in the form of E - book. Further, students can attend internet based live virtual classroom session for select subjects as well as quarterly Personel Contact Program (PCP) at the institute during the 1st year. PCP are optional and can be attended after paying additional nominal fees. Simultaneously, students are activated on the system so that they can check various facilities offered to them like : E-Learning Tool Kit, WeLectures, WeTube, NewsWire service, Placement opportunity etc. 

EVALUATION CRITERIA AND ASSESSMENTS 
In every semester, there is a mid-term exam and a semester exam. • Every subject portion is divided into two parts. The mid-term exam is based on a few initial chapters and the semester exam is based on the remaining chapters. • Both mid-term as well as semester exams are out of 50 marks. However, a mid-term assignment carries about 20% weightage and a semester exam carries 80% weightage. To clear a subject, a student has to secure minimum 50% marks which is a total weightage percentage of both exams

Enrollment • There will be four batches each year- January, April, July and October • Specialization should be selected in the enrollment form. Preferred center for the examination / PCP center should also be selected in the enrollment form itself 

Enclosures • Evidence of graduation • 1 recent passport size colour photograph
","placement":"Placement Support System 
For the convenience of students, a new initiative has been undertaken by the PGDM-Hybrid Learning Cell, 'Placement Information'. Job opportunities and global vacancies are uploaded on our website, www.welingkaronline.org on a daily basis. A student, after enrolling for the program, can see all job openings state-wise and specialization-wise on the website, under the head 'Placement Opportunities'.
","scholarship": "",
        "gallery": "",
        "review":"The PGDM-HB program helped me grow to my potential and reach to the blue ocean in my career. This program builds leadership qualities through experimental learning workshops. It’s really a boon for the working professionals who can take benefits of this excellent courseware, learn through its e-learning modules, and take help from professors in web-based classroom sessions as per their own convenience and flexibility.
Diganta Sengupta 
SR Conusltant 
Capgemini India Pvt Ltd
This course has given me a better understanding of how the entire management process works. The value added activities here, VCF lectures, workshops, etc, help you get in touch with people from different sectors and from different walks of life. You can witness how they deal with life and how the HB program is currently helping them. 
Rebecca Figueiredo
","extra": ""
    },
    {
        "about":"NMIMS Global is amongst India's top institutions in the distance education space.
NMIMS Global began its ed-tech journey in 2013 with a state of the art learning management system to provide blended learning on connected platforms 24/7.
NMIMS Global is changing the dynamics of higher education delivery in India while empowering students across India and enabling them to fulfil their dreams and aspirations.
","coursesandfees":"Master of Business Administration MBA 
The 2-year MBA (Distance) program is designed to provide working professionals the flexibility to pace the program to fit their schedule, without the need to deprioritise their professional or personal commitments
Program Specialisations
Business Management - Master concepts to broaden and deepen core management concepts and business thinking models.
Financial Management - Gain a better understanding of the fundamentals of finance, auditing, accounting, and capital management while also learning the fundamentals of business management.
Marketing Management - Get a deeper understanding of the various functions and principles of marketing which can be practically applied in the corporate world at regional and global level
Banking and Finance - Gain in-depth knowledge of financial business operations, policies and understand the dynamic nature of stock markets, securities, and the global economy.
Operations Management - Build professional competencies in production and operations management, distribution channels & logistics, procurement, and quality management.
Human Resource Management - Learn the fundamentals of talent training, recruiting, retention, industrial relations, organisational skills, and their practical application in a corporate environment.
Supply Chain Management - Learn concepts used in supply chain management and delve deeper into its theory and application.
IT & Systems Management - Develop critical thinking, managerial skills & grasp the use of modern techniques to analyse and develop business solutions.
International Trade Management - Delve into trading policies, exchange of capital, producing and sourcing goods and services from across the globe.
Retail Management - Become adept in understanding retail environment management, and planning, evaluating, building, selecting, and effectively managing channels for retail distribution.

Duration
Minimum 2 years (divided into 4 semesters), maximum 4 years 

Students can choose MBA (Distance) in Pro and Prime mode: 
Prime: allows students to view recorded lectures
Prime+: allows students to gain access to live-interactive lectures of their choice at a fee of Rs. 1,
        200/- for individual subjects
Pro: allows students to attend live-interactive lectures and access recorded lectures as well

One time Admission Processing Fee of Rs. 1,
        200/- applicable  
An initial amount of Rs. 5,
        000/- from the program fee shall be collected at the time of registration
An examination fee of Rs.600 will be charged per exam per attempt  
EMI Facility available via credit cards from leading banks  
20% fee waiver for Defence personnel and their immediate family members (Parents, Siblings or Spouse).
","admission":"Registration - Register online at online.nmims.edu Post registration, a student counsellor will get in touch with you. 
Document Submission  - Submit relevant academic and work-experience documents.
Fee Submission - You may confirm your admission by paying the fee online, or by sending a demand draft in favour of 'SVKM's NMIMS' payable at Mumbai.
Confirmation - On successfully completing all above-mentioned steps, you will receive a confirmation letter from our admissions team with further details. A ‘student number’ will be issued to you when the submitted documents and payments are approved by the University
Eligibility Criteria
Bachelor’s Degree (10+2+3) in any discipline from any recognised University or an equivalent degree recognised by Association of Indian Universities (AIU) with minimum 50% marks at graduation Level. 
OR 
Bachelor’s Degree (10+2+3) in any discipline from any recognised University or equivalent degree recognised by Association of Indian Universities (AIU) with less than 50% marks at graduation level and a minimum of 2 years of work experience.
","placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "about":"Online Master of Business Administration (MBA)
Equip yourself with the necessary managerial skills and analytical tools with our UGC Entitled Online MBA programme.
Get more than just a Degree with access to various exclusive resources, online courses, webinars and certifications!
","coursesandfees":"Programme Curriculum
FIRST SEMESTER 
FINANCIAL REPORTING STATEMENTS AND ANALYSIS
MANAGERIAL ECONOMICS
INTERNATIONAL BUSINESS ENVIRONMENT
MARKETING MANAGEMENT
ORGANISATIONAL BEHAVIOUR & HUMAN RESOURSE DYNAMICS

SECOND SEMESTER 
CORPORATE FINANCE
OPERATIONS MANAGEMENT & RESEARCH 
BUSINESS ANALYTICS
RESEARCH METHODOLOGY
LEGAL ASPECTS OF BUSINESS
COMMUNICATION FOR LEADERS

THIRD SEMESTER 
DISCIPLINE SPECIFIC ELECTIVE - I
DISCIPLINE SPECIFIC ELECTIVE - II
DISCIPLINE SPECIFIC ELECTIVE - III
SEMINAR ON SUMMER TRAINING
GENERIC ELECTIVE - I 
CORPORATE STRATEGY & ENTREPRENEURSHIP

FORTH SEMESTER 
DISCIPLINE SPECIFIC ELECTIVE - IV 
DISCIPLINE SPECIFIC ELECTIVE - V
DISCIPLINE SPECIFIC ELECTIVE - VI
GENERIC ELECTIVE - II 
CAPSTONE PROJECT

Specializations: Student may choose two areas from Discipline Specific Elective Basket/Specializations; 3 courses from first area to be studied in semester 3 and 3 courses from second area to be studied in semester 4.

Duration: 2 Years (Maximum 4 years)
","admission":"Eligibility Criteria: Bachelor's degree (any discipline) or equivalent or Completed Company Secretary (CS) from Institute of Company Secretaries of India (ICSI) or Completed Chartered Accountancy (CA) from Institute of Chartered Accountants of India (ICAI) or Completed Cost & Management Accountancy (CMA) from Institute of Cost Accountants of India (ICAI)
","placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about":"Accelerate your career growth with an online MBA
The online MBA programme at MUJ empowers you to take on leadership roles in an increasingly complex and dynamic world. This programme equips you with cutting-edge skills and advanced business fundamentals that will propel you in your career as a future leader. The programme also provides an opportunity to choose from their eight strategic electives to specialize in an area of your choice.
","coursesandfees":"Programme structure 
All students follow the same curriculum in the first and second semesters. While some core subjects are standard in the third and fourth semesters, courses will vary depending on their respective electives or specializations.
First Semester - Management Process and Organisational Behaviour  , Business Communication , Statistics for Management  , Financial and Management Accounting , Managerial Economics , Human Resource Management .
Second Semester - Production and Operations Management , Financial Management  , Marketing Management , Management Information System  , Operations Research , Project Management .
Third Semester - Research Methodology , Legal Aspects of Business,
        4 Subjects in the Area of Specialisation (4 credits each) . 
Fourth Semester - Strategic Management & Business Policy , International Business Management, Business Leadership  ,
        4 Subjects in the Area of Specialisation (4 credits each) , Project.


Duration
Minimum 2 years (divided into 4 semesters), maximum 4 years 
Students will be required to put in 18-21 hours of study time per week
Fee structure 
Course Fees: INR 1,
        50,
        000/- or INR 37,
        500/- per semester, which includes an examination fee of INR 5,
        000/- 
","admission":"Admission process
Application to online degrees at MUJ can be initiated through our website .www.onlinemanipal.com. 
Our counselors will guide candidates through the admission process, which is as per regulatory requirements. 
Applicants must submit a completed application form with relevant documents within the due date. 
Please visit the FAQ section on our website to know more about the admission process.

Eligibility
Candidates must have a 10 + 2 + 3-year bachelor’s degree from a recognized university/institution or an equivalent qualification recognized by the Association of Indian Universities or other competent bodies in any discipline with a minimum of 50% marks in aggregate (45% for reserved categories). 
Candidates must have a valid score from any aptitude test (CAT/MAT/CMAT/XAT/GMAT).
Candidates without an aptitude test score need to appear and clear the online aptitude test conducted by Manipal University Jaipur as per admission norms to the MBA programme.
","placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about":"CU Institute of Distance & Online Learning (CU-IDOL) 
The primary objective of CU-IDOL is to take a comprehensive approach to content, technology marketing, and services in order to provide high-quality education in close collaboration with businesses and academia, resulting in rigorous and industry-relevant programmes.
","coursesandfees":"Master of Business Administration MBA 
The Master of Business Administration (MBA) is a recognized professional degree that focuses on improving the skills required for career in business and management. This program highlights the importance of international business and management education while also providing an overview of a global scope. The module is a real-life simulation of business arena and provides learners the opportunity to apply the concepts and theories learnt during the core module to a real-life project.

Fee Structure
Per Semester Fee - ₹16340/- 
Prospectus Fee: ₹500/- (one time) 
SLM hard copy charges (optional): ₹1500/- 
","admission":"How to apply for Admission 
Visit www.cuidol.in & click on Apply Now 
At homepage under Register Today, Fill up the required details and click on Register Now. (Full Name, Email ID, Mobile No.,Programme, Date of Birth) After completion of the above process, candidate needs to login to fill up the application using the User ID and Password sent through SMS and Email. Candidate may also use registered Email ID as username to log in.
Click on Buy Now and complete the payment to purchase the soft copy of Prospectus (Prospectus Fee: Rs. 500/-). After successful payment, candidate can download the prospectus and Application Form will be activated.
Click on the Application Form, fill up with your details and pay the Program Fee. Candidate needs to fill up Personal Details, Contact Details and Qualification Details. After that candidate needs to pay Program Fee online. After successful payment, Document Upload option will be activated.
Click on the Document Upload and then upload all necessary documents and recent passport size photograph and click on Submit Button. All the documents should be clearly visible to process the application form further. Candidate will receive the confirmation for successful submission of the application on registered contact number and Email address.

EligibilityBachelor’s degree from a recognized university or institution in any discipline. Graduates of accredited professional programs like CA/ICWA are also qualified.

Duration 
2 years (4 semesters) 
","placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about":"MIT School of Distance Education (MITSDE) is an integral constituent of MAEER’s MIT Pune, established in the year 2008. MAEER’s MIT was founded in the year 1983 by Dr. Vishwanath D. Karad, (Founder, Executive President & Managing Trustee) along with the collective effort of many educationists and social thinkers. MIT is among the first in professional education offering academic programs at more than 72 institutions and 4 universities across India. Drawing on the rich history of excellence in education and innovation, MITSDE’s offerings, curriculum design and delivery methodologies are unique and come together to offer the best-designed distance education programs that efficiently bridge the skills gap for working professionals

MITSDE Unique Features
100% placement assistance 
CANVAS LMS - Learning-on-the-go 
EMI Facility 
Continuous Engagement through Live sessions, Master class, Industry connect Conclave and hands- on workshops 
Academic Support through a dedicated academic team
Career Services with Student Career Help Desk
","coursesandfees":"Post Graduate Diploma in Management (PGDM) 

Post Graduate Diploma (PGDM) in Project Management 
The course is designed on the lines of the curriculum of the Project Management Institute (PMI), by eminent trainers and experts. The course nurtures project managers to play a pivotal role in planning, executing and evaluating projects successfully.

Post Graduate Diploma (PGDM) in Operations Management 
PGDM in Operations Management prepares you to confront the challenges in the eld, head-on. Academic & industrial experts have designed the curriculum keeping in mind the current orientation of the global industry. To partake in the opportunities provided by the enlarged scale of operations globally.

Post Graduate Diploma (PGDM) in Human Resource Management
A PGDM in Human Resource Management can catapult your career in the appropriate direction. Designed by a team of experienced HR professionals, the comprehensive course focuses on the theory, technology and changing practices worldwide.

Post Graduate Diploma (PGDM) in Information Technology Management
The PGDM IT course has been designed to suit your varied needs. The program gives a complete understanding of the broad conceptual or theoretical elements and the emerging technological developments in the IT arena, keeping in mind the tight working schedules of IT professionals. 

Post Graduate Diploma (PGDM) in Marketing Management 
The course equips you with the knowledge of strategy formulation, understanding of global markets and emerging trends in digital marketing. It cultivates an innovative mindset and global perspective to be ready for future markets. 

Post Graduate Diploma (PGDM) in Finance Management 
The PG Diploma in Finance Management is suitably designed to be an asset in the ever-expanding nancial sector. The course prepares you for ntech, investments and other nance-associated jobs that are nding their way in the new digitized world. 

Post Graduate Diploma (PGDM) Logistics and Supply Chain Management 
The PG Diploma in Logistics and Supply Chain Management course covers aspects like Blockchain, e-commerce logistics management, risk management framework and other global logistics & supply chain trends. The program thus helps you diversify your knowledge to suit business needs.

Post Graduate Diploma (PGDM) Material Management 
The PG Diploma in Material Management presents a range of opportunities globally due to digital advancements and the emergence of e-commerce. Scope of materials management entails material planning, control purchasing, inventory control, and much more. 

Post Graduate Diploma (PGDM) Banking & Financial Services 
The PG Diploma in Financial Services teaches you crucial management concepts and makes you immediately employable in a host of important sectors like Banking, Insurance, Mutual Funds, Stocks and other finance-related functions that welcome talented financial services managers with a PG diploma.

Post Graduate Diploma (PGDM) Construction and Project Management 
The PG Diploma in Construction and Project Management course prepares you for challenging roles within the construction and real estate domain, imparting the best theoretical as well as practical knowledge. It helps you develop the ability to lead a team of consultants, builders and site managers. 

Duration: 21 months | Semesters: 3 | Eligibility: Any Graduate | Total credits: 78
","admission": "",
        "placement":"MITSDE Placement Cell
 Recruitment drives and Job Listing • Networking with the corporate to recruit the best talent in the industry • Access to a wide scope of opportunities via in-house placement portal listing job openings updated on weekly basis. • Career Planning & Counselling through a dedicated Career Help desk • Help you to identify best-suited career opportunities • Assistance in resume/CV building, interview preparations, the solution to all career-related queries Industry guidance • Career updates through Industry experts • Personalized feedback of Interviews and much more
","scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about": "• IIMA - An autonomous institution set up in 1961 by the Government of India in collaboration with the Government of Gujarat and the Indian Industry. • First institute to receive International EQUIS (European Quality Improvement System) accreditation and has maintained it since then. • Ranks 2nd in position in the National Institutional Ranking Framework (NIRF) India Ranking 2019, by the MHRD, Government of India. • Globally, the Institute is recognized for its distinct contribution to thought leadership and organizational strategy with its alumni driving growth stories of several international and national organizations world over.",
        "coursesandfees":"Two-year post-graduate programme (with added flexibility of completion in 3 years) offered on Virtual Interactive Learning Platform (VILP) platform leading to Master of Management Studies (eLearning Mode) upon successful completion. 
• The course is imparted over more than 850 hours of classroom sessions and project work and provides the participants with leadership skills for the knowledge economy through an innovative curriculum. 
• The objective of the programme is to impart management education to working professionals and entrepreneurs who are seeking skills and strategies to take their organizations to the next level 

Programme Fees
Programme Fees INR 20,
        00,
        000 
Application Fees INR 1,
        000/- (For IAT Candidates only)
","admission":"Programme Eligibility
Working Professionals and Entrepreneurs with a minimum of 3 years’ fulltime work experience (after completion of graduation) as on March 31, 2020. 
• Minimum Age 24 years and above as on March 31,
        2020 (born on or before March 31,
        1996). 
• Holding at least a Bachelor’s Degree/CA/CS/ICWA, with at least 50 percent marks in aggregate or equivalent CGPA, awarded by any of the recognized universities. 

Minimum V

\8
    ][‘p;olikujyhgfxcfvgbum lid Cut-offs for Application
","placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about": "",
        "coursesandfees": "",
        "admission": "",
        "placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about": "",
        "coursesandfees": "",
        "admission": "",
        "placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about": "",
        "coursesandfees": "",
        "admission": "",
        "placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    },
    {
        "name": "",
        "about": "",
        "coursesandfees": "",
        "admission": "",
        "placement": "",
        "scholarship": "",
        "gallery": "",
        "review": "",
        "extra": ""
    }
]